In [1]:
"""
Period and Periodindex adalah cara pandas untuk merepresentasikan waktu dan tanggal
contoh: 2019-01-01, 2019-01-02, 2019-01-03, dst
"""
import pandas as pd

## Using period

In [6]:
y = pd.Period('2019') #periood adalah fungsi untuk membuat objek period
y.__dir__() #untuk melihat method apa saja yang bisa digunakan
print(y.start_time) #untuk melihat waktu awal period
print(y.end_time) #untuk melihat waktu akhir period

2019-01-01 00:00:00
2019-12-31 23:59:59.999999999

In [8]:
m = pd.Period('2019-01',freq='M') #period dengan format tahun-bulan
print(m.start_time)
m

2019-01-01 00:00:00

Period('2019-01', 'M')

In [9]:
m+1

Period('2019-02', 'M')

In [10]:
d = pd.Period('2019-01-01',freq='D') #period dengan format tahun-bulan-tanggal
print(d.start_time)
d

2019-01-01 00:00:00

Period('2019-01-01', 'D')

In [11]:
d+1

Period('2019-01-02', 'D')

In [14]:
h = pd.Period('2019-01-01 00:00:00',freq='H') #period dengan format tahun-bulan-tanggal jam:menit:detik
h+pd.offsets.Hour(99) #offsets adalah fungsi untuk menambahkan waktu

Period('2019-01-05 03:00', 'H')

In [15]:
q = pd.Period('2019Q1',freq='Q-JAN') #period dengan format tahun-kuartal, Q-JAN adalah kuartal dimulai dari bulan januari
q

Period('2019Q1', 'Q-JAN')

In [16]:
q.asfreq('M',how='start') #asfreq adalah fungsi untuk mengubah period menjadi format lain, how='start' adalah untuk mengubah menjadi awal period

Period('2018-02', 'M')

In [17]:
q2 = pd.Period('2020Q2',freq='Q-JAN')
q2

Period('2020Q2', 'Q-JAN')

In [18]:
q2-q #untuk menghitung selisih period

In [22]:
idx = pd.period_range('2011', periods=10, freq='Q-JAN') #period range adalah fungsi untuk membuat periodindex
idx[0].start_time

Timestamp('2010-11-01 00:00:00')

In [23]:
import numpy as np
ps = pd.Series(np.random.randn(len(idx)), idx) #series dengan periodindex
ps

2011Q4    1.086872
2012Q1    1.432076
2012Q2    1.058329
2012Q3   -0.073217
2012Q4   -0.545365
2013Q1   -0.356118
2013Q2    2.700797
2013Q3    1.276247
2013Q4   -1.074825
2014Q1    1.316800
Freq: Q-JAN, dtype: float64

In [26]:
ps["2011"].to_timestamp(how='start') #untuk mengubah periodindex menjadi timestamp

2010-11-01    1.086872
2011-02-01    1.432076
2011-05-01    1.058329
2011-08-01   -0.073217
2011-11-01   -0.545365
Freq: QS-NOV, dtype: float64

## Using periodindex

In [30]:
df = pd.read_csv("Dataset/wmt.csv")
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [31]:
df.set_index('Line Item',inplace=True) #mengubah kolom menjadi index
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [36]:
df = df.T #untuk mentranspose dataframe
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [37]:
df.index = pd.PeriodIndex(df.index, freq='Q-JAN') #mengubah index menjadi periodindex
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]')

In [40]:
df["start date"] = df.index.map(lambda x: x.start_time) #menambahkan kolom start date
df["end date"] = df.index.map(lambda x: x.end_time) #menambahkan kolom end date
df

Line Item  Revenue  Expenses  Profit start date                      end date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   31369 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117542     87688   29854 2017-02-01 2017-04-30 23:59:59.999999999